{
  "triggerOnUpdates": true,
  "shouldUpdateDescription": true,
  "statusCheck": true,
  "statusCommentsEnabled": true,
  "fixWithAI": true,
  "strictness": 3,
  "includeBranches": ["main", "dev"],
  "ignorePatterns": "src/routes/routeTree.gen.ts\ndrizzle/*.sql\npublic/**\n*.md\nbun.lockb\n.dev.vars",
  "summarySection": {
    "included": true,
    "collapsible": false,
    "defaultOpen": true
  },
  "issuesTableSection": {
    "included": true,
    "collapsible": false,
    "defaultOpen": true
  },
  "confidenceScoreSection": {
    "included": true,
    "collapsible": true,
    "defaultOpen": false
  },
  "sequenceDiagramSection": {
    "included": true,
    "collapsible": true,
    "defaultOpen": false
  },
  "customContext": {
    "rules": [
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "rule": "All imports from the src directory MUST use the '@/' path alias (e.g. '@/components/nav', '@/lib/utils'). Never use relative imports like '../' or './' when referencing files inside src/."
      },
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "rule": "NEVER import Node.js built-in modules (fs, path, crypto, http, net, os, child_process, etc.) directly. This project runs on Cloudflare Workers which has limited Node.js compatibility. Use Web APIs or Cloudflare-specific APIs instead (e.g. Web Crypto API instead of 'crypto', fetch instead of 'http')."
      },
      {
        "scope": ["src/**/*.tsx"],
        "rule": "For conditional or dynamic CSS class names, always use the 'cn()' utility from '@/lib/utils' (which combines clsx + tailwind-merge). Never use manual string concatenation or template literals for class names."
      },
      {
        "scope": ["src/**/*.tsx"],
        "rule": "Use Tailwind CSS semantic theme color tokens defined in styles.css (e.g. 'text-text-primary', 'text-text-secondary', 'text-text-muted', 'bg-background', 'bg-surface', 'border-border', 'text-accent', 'bg-accent-soft', 'border-accent-glow'). Do NOT hardcode hex colors like '#121215' or '#5CCC8E' directly in components. All colors should reference the theme system."
      },
      {
        "scope": ["src/components/**/*.tsx"],
        "rule": "All animated components MUST use the 'useAnimateOnce()' hook from '@/lib/motion' for scroll-triggered animations instead of raw Framer Motion 'useInView' or 'whileInView'. This ensures animations play only once and respect the 'prefers-reduced-motion' user preference. Use the 'm.' (lazy motion) prefix instead of 'motion.' for animated elements."
      },
      {
        "scope": ["src/lib/*-action.ts", "src/lib/**/*-action.ts"],
        "rule": "Server functions MUST be created using 'createServerFn()' from '@tanstack/react-start'. They MUST include '.inputValidator()' for input validation before the '.handler()'. Never trust client input without validation. All server functions should return a typed response object like '{ success: boolean; error?: string }'."
      },
      {
        "scope": ["src/lib/*-action.ts", "src/lib/**/*-action.ts"],
        "rule": "Server-only modules (like 'drizzle-orm', database clients, or modules accessing Cloudflare bindings) MUST be dynamically imported inside the handler using 'await import()'. This prevents server-only code from being bundled into the client."
      },
      {
        "scope": ["src/db/**/*.ts"],
        "rule": "Database schema changes MUST use Drizzle ORM's SQLite dialect (sqliteTable, text, integer, etc.). Never write raw SQL in application code. Always generate migrations via 'drizzle-kit generate' rather than writing migration files by hand."
      },
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "rule": "NEVER commit secrets, API keys, or sensitive tokens in source code. Environment variables must be accessed through Cloudflare Worker bindings (env.DB, env.TURNSTILE_SECRET_KEY) inside server functions only. Client-side code must never reference secret keys."
      },
      {
        "scope": ["src/routes/**/*.tsx"],
        "rule": "Route files follow TanStack Router file-based routing conventions. Each route MUST export a 'Route' object created with 'createFileRoute()'. Do NOT manually register routes or modify 'routeTree.gen.ts' - it is auto-generated by the TanStack Router plugin."
      },
      {
        "scope": ["src/**/*.tsx"],
        "rule": "Components must be functional components using hooks. No class components. Export named functions, not default exports. Keep components focused - if a component exceeds ~200 lines, consider splitting it into smaller composable components."
      },
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "rule": "Do NOT use 'any' type. Use 'unknown' with proper type narrowing, or define explicit types/interfaces. TypeScript strict mode is enabled - leverage it fully. All function parameters and return types should be inferable or explicitly typed."
      },
      {
        "scope": ["src/**/*.tsx"],
        "rule": "Do NOT use 'document.querySelector', 'document.getElementById', or other direct DOM manipulation APIs. Use React refs (useRef) and React state for all DOM interactions. Direct DOM access breaks SSR on Cloudflare Workers."
      },
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "rule": "Do NOT use 'console.log' in production code. Remove all debugging statements before merging. Use proper error handling and return typed error responses from server functions instead."
      },
      {
        "scope": ["src/components/**/*.tsx"],
        "rule": "All interactive elements (buttons, links, form inputs) MUST have proper accessibility attributes. Buttons need descriptive text or aria-label. Images need alt text. Form inputs need associated labels. Anchor tags acting as buttons should use <button> instead."
      },
      {
        "scope": ["vite.config.ts", "wrangler.jsonc", "tsconfig.json", "drizzle.config.ts"],
        "rule": "Configuration file changes are high-impact and should be reviewed carefully. Changes to wrangler.jsonc affect the Cloudflare Workers deployment. Changes to vite.config.ts affect the build pipeline. Ensure compatibility flags and bindings are correct."
      }
    ],
    "files": [
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "path": "CLAUDE.md",
        "description": "Project development guidelines and constraints"
      },
      {
        "scope": ["src/db/**/*.ts"],
        "path": "src/db/schema.ts",
        "description": "Database schema reference - new tables/columns must follow existing Drizzle ORM patterns"
      },
      {
        "scope": ["src/**/*.tsx"],
        "path": "src/lib/motion.ts",
        "description": "Animation utilities and hooks - all animation patterns should use these shared utilities"
      },
      {
        "scope": ["src/**/*.tsx"],
        "path": "src/styles.css",
        "description": "Tailwind CSS theme configuration - all colors and design tokens are defined here"
      }
    ],
    "other": [
      {
        "scope": ["src/**/*.ts", "src/**/*.tsx"],
        "content": "This is a TanStack Start (React 19) portfolio site deployed on Cloudflare Workers with D1 (SQLite) database. It uses Tailwind CSS v4, Framer Motion (lazy motion), and Drizzle ORM. There is NO traditional API - server logic uses TanStack Start server functions. The site is SSR-rendered on the edge. All code must work in the Cloudflare Workers runtime which has limited Node.js compatibility."
      }
    ]
  }
}
